Repository: ibrahim-s/linkLibrary
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, tr, uk

source: Creating folder to store data files in home user directory ... You can press on Cancel button to skipt this, and adjust this later from the addon's settings dialog,Do you wants to proceed in creating the addons data folder in your home user directory?
ar: عمَل مسار لِملفات البيانات في مُجَلَّد المستخدم... تستطيع الضغط على زر الإلغاء لِتجاوُز هذا, و ضبط ذلك مِن مُحاورةْ الإعدادات لاحقا, هل تُحب الإستمرار في إنشاء مُجَلَّد البيانات في مسار المستخدم؟
tr: Kkullanıcı dizininde veri dosyalarını depolamak için klasör oluşturuluyor... Bunu atlamak için İptal düğmesine basabilir ve bunu daha sonra eklentinin ayarlar iletişim kutusundan ayarlayabilirsiniz, Kullanıcı dizininizde eklenti veri klasörünü oluşturmaya devam etmek istiyor musunuz?
uk: Створення папки для зберігання файлів у домашньому каталозі користувача ... Ви можете натиснути кнопку «Скасувати», щоб пропустити це, і змінити цей параметр пізніше в діалозі налаштувань додатка. Ви бажаєте продовжити створення папки додатка у вашому домашньому каталозі користувача?

source: This name is already present for another library, enter another name please
ar: هذا الإسم موجود لِمكتبة أخرى, يُرجى إدخال إسم آخَر
tr: Bu ad başka bir kitaplık için zaten mevcut, lütfen başka bir ad girin
uk: Ця назва вже існує для іншої бібліотеки, будь ласка, введіть іншу назву

source: Warning
ar: تنبيه
tr: Uyarı
uk: УВАГА

source: Failed to open library, or may be library file is not valid.
ar: لَم تنجح عمليةْ فتح المكتبة, أو ربما ملف المكتبة غير صالح.
tr: Kitaplık açılamadı veya kitaplık dosyası geçerli değil.
uk: Не вдалося відкрити бібліотеку або файл бібліотеки недійсний.

source: Error
ar: خَطَأ
tr: Hata
uk: Помилка

source: Link Library Bookmarks
uk: Закладки бібліотеки посилань

source: Json File
ar: ملف Json
tr: Json Dosyası
uk: Файл Json

source: Html File
ar: ملف Html
tr: Html Dosyası
uk: Файл Html

source: Export Library As
ar: تصدير المكتبة بِصيغةْ
tr: Kitaplığı Dışa Aktar
uk: Експорт бібліотеки як

source: Import Library(as Json)
ar: إستيراد مكتبة(بِصيغةْ Json)
tr: Kitaplığı İçe Aktar (Json olarak)
uk: Імпорт бібліотеки (як Json)

source: Import Firefox Bookmark Libraries(as Json)
uk: Імпорт бібліотек закладок Firefox (як Json)

source: Failed to export library
ar: لَم يَنجح تصدير المكتبة
tr: Kitaplık dışa aktarılamadı
uk: Не вдалося експортувати бібліотеку

source: Information: Library Exported
ar: تنبيه: قد تَمَّ تصدير المكتبة
tr: Bilgi: Kitaplık Dışa Aktarıldı
uk: Інформація: Бібліотека експортована

source: Importfailed; chosen file seems not valid.
ar: لَم ينجح الإستيراد; يبدو أنّ الملف المُختار غير صالح.
tr: İçe aktarma başarısız; seçilen dosya geçerli değil gibi görünüyor.
uk: Помилка імпорту; вибраний файл недійсний.

source: Import Error
ar: خَطَأ في الإستيراد
tr: İçe Aktarma Hatası
uk: Помилка імпорту

source: Sorry, importing of library failed
ar: المعذرة, لم تنجح عمليةْ استيراد المكتبة
tr: Üzgünüm, kitaplık içe aktarılamadı
uk: На жаль, не вдалося імпортувати бібліотеку

source: Information: Library imported.
ar: تنبيه: تَمَّ استيراد المكتبة.
tr: Bilgi: Kitaplık içe aktarıldı.
uk: Інформація: Бібліотека імпортована.

source: Sorry, but it seems that the file is not a firefox bookmarks json file
uk: Вибачте, але, схоже, цей файл не є файлом json закладок Firefox

source: Information: Firefox bookmarks imported.
uk: Інформація: імпортовано закладки Firefox.

source: A library with similar name already exists, do you want to merge the two libraries?
ar: هناك مكتبة موجودَة بِنفس الإسم, هل ترغب في دمج المكتبتين؟
tr: Benzer ada sahip bir kitaplık zaten var, iki kitaplığı birleştirmek istiyor musunuz?
uk: Бібліотека з подібною назвою вже існує. Об’єднати дві бібліотеки?

source: Information
ar: تعليمات
tr: Bilgi
uk: Інформація

source: Link Library - {}
ar: مكتبةْ الروابط- {}
tr: Bağlantı Kitaplığı - {}
uk: Бібліотека посилань - {}

source: Choose a library
ar: إخترْ مكتبة
tr: Bir kitaplık seçin
uk: Виберіть бібліотеку

source: Add new library
tr: Yeni kitaplık ekle
uk: Додати нову бібліотеку

source: Rename library
ar: إعادةُ تسميةِ المكتبة
tr: Kitaplığı yeniden adlandır
uk: Перейменувати бібліотеку

source: Remove library
ar: إزالة المكتبة
tr: Kitaplığı kaldır
uk: Видалити бібліотеку

source: OK
ar: موافِق
tr: Tamam
uk: Гаразд

source: Cancel
ar: إلغاء
tr: İptal
uk: Скасувати

source: Information:Failed to create directory.
ar: تنبيه: لَم يَنجح إنشاء المسار.
tr: Bilgi: Dizin oluşturulamadı.
uk: Інформація: Не вдалося створити каталог.

source: Has sub library
ar: لديها مكتبة فرعية
tr: Alt kitaplığı var
uk: Має підбібліотеку

source: Enter library name please
ar: أدخِلْ إسم المكتبة لو سَمَحْت
tr: Lütfen Kitaplık adını girin
uk: Будь ласка, введіть назву бібліотеки

source: Add Library
ar: أضِفْ مكتبة
tr: Kitaplık Ekle
uk: Додати бібліотеку

source: Enter new name please
ar: أدخِلْ إسماً جديداً لو سَمَحْت
tr: Lütfen yeni ad girin
uk: Будь ласка, введіть нове ім'я

source: rename
ar: إعادةْ التسمية
tr: yeniden Adlandır
uk: перейменувати

source: This library has sub libraries. Are you sure you want to remove {} library with it's sub libraries, this can not be undone?
ar: هذه المكتبة فيها مكتبات فرعية. هل أنتَ مُتأكِدْ مِن أنكَ تُريد إزالةْ المكتبة {} مع مكتباتها الفرعية, فهذا الأمر لا يُمكنْ التراجع عنه؟
tr: Bu kitaplığın alt kitaplıkları var. {} kitaplığını alt kitaplıklarıyla birlikte kaldırmak istediğinizden emin misiniz, bu işlem geri alınamaz?
uk: Ця бібліотека має підбібліотеки. Ви впевнені, що хочете видалити бібліотеку {} разом з її підбібліотеками? Це неможливо буде скасувати?

source: Are you sure you want to remove {} library, this can not be undone?
ar: هل أنتَ مُتأكِدْ مِن أنكَ تُريد إزالةْ المكتبة {}, فهذا الأمر لا يُمكنْ التراجع عنه؟
tr: {} kitaplığını kaldırmak istediğinizden emin misiniz, bu işlem geri alınamaz?
uk: Ви впевнені, що хочете видалити бібліотеку {}, цю дію неможливо скасувати?

source: A library dialog is already opened; Close it first please.
ar: هناكْ مكتبة مفتوحة مِن قبلْ; أغلِقْها أولا لو سمَحْت
tr: Bir kitaplık iletişim kutusu zaten açık; Lütfen önce açık olanıkapatın.
uk: Діалог бібліотеки вже відкрито; Спочатку закрийте, будь ласка.

source: information
ar: تعليمات
tr: bilgi
uk: інформація

source: This url is for {}; please enter another one
ar: هذا الرابط لِ {}; أدخِلْ رابطْ آخَر لو سمحْت
tr: Bu url {} içindir; lütfen başka bir tane girin
uk: Ця адреса вказана для {}; будь ласка, введіть іншу адресу

source: This label({}) is chosen for {}; please enter another one
ar: هذا الإسم({}) هو مُختار لِ {}; أدخِلْ إسمْ آخَر لو سمحْت
tr: Bu etiket({}), {} için seçili; lütfen başka bir tane girin
uk: Ця назва ({}) вказана для {}; введіть іншу

source: Add Sub library
ar: أضِفْ مكتبة فرعية
tr: Alt kitaplık ekle
uk: Додати підбібліотеку

source: Rename Sub library
ar: إعادةْ تسمية المكتبة الفرعية
tr: Alt kitaplığı yeniden adlandır
uk: Перейменувати підбібліотеку

source: Remove Sub library
ar: إزالة المكتبة الفرعية
tr: Alt kitaplığı kaldır
uk: Видалити підбібліотеку

source: Add A Link
ar: أضِفْ رابط
tr: Bağlantı Ekle
uk: Додати посилання

source: Edit Selected link
uk: Редагувати вибране посилання

source: Move Link To
ar: نقل الرابط إلى
tr: Bağlantıyı Şuraya Taşı
uk: Перемістити посилання до

source: Remove Selected link
uk: Видалити вибране посилання

source: Remove All Links
ar: إزالةْ جميع الروابط
tr: Tüm Bağlantıları Kaldır
uk: Видалити всі посилання

source: Enter sublibrary name please
ar: أدخِلْ إسم المكتبة الفرعية لو سَمَحْت
tr: Lütfen Alt Kitaplık adını girin
uk: Будь ласка, введіть назву підбібліотеки

source: Add subLibrary for {}
ar: إضافة مكتبة فرعية لمكتبة {}
tr: {} için alt Kitaplık ekle
uk: Додати підбібліотеку для {}

source: This name is already present for another sub library, enter another name please
ar: هذا الإسم موجود لِمكتبة فرعية أخرى, يُرجى إدخال إسم آخَر
tr: Bu ad zaten başka bir alt kitaplık için mevcut, lütfen başka ad girin
uk: Ця назва вже існує для іншої підбібліотеки, будь ласка, введіть іншу назву

source: Rename sub library
ar: إعادةُ تسمية المكتبة الفرعية
tr: Alt kitaplığı yeniden adlandır
uk: Перейменувати підбібліотеку

source: Are you sure you want to remove the sub library {}, this can not be undone?
ar: هل أنتَ مُتأكِدْ مِن أنكَ تُريد إزالةْ المكتبة الفرعية {}, فهذا الأمر لا يُمكنْ التراجع عنه؟
tr: {} alt kitaplığını kaldırmak istediğinizden emin misiniz, bu işlem geri alınamaz?
uk: Ви впевнені, що хочете видалити підбібліотеку {}, це не можна скасувати?

source: Enter Link source(www...)
ar: أدخِلْ الرابط(www...)
tr: Bağlantı kaynağını girin(www...)
uk: Введіть джерело посилання (www...)

source: Enter Link Label Please
ar: أدخِلْ إسم الرابط لو سمحْت
tr: Lütfen Bağlantı Etiketini Girin
uk: Будь ласка, введіть назву посилання

source: Link Label
ar: إسم الرابط
tr: Bağlantı Etiketi
uk: Назва посилання

source: Write Something About The Link
ar: أُكتبْ شيئا عن الرابط
tr: Bağlantı Hakkında Bir Şey Yazın
uk: Напишіть щось про посилання

source: About
ar: حول
tr: Hakkında
uk: Про

source: This link is already present in {library} library, under {label} label; Do you still want to replace it with the one you are about to move?.
ar: هذا الرابط أصلاً موجود في المكتبة {library}, تحت اسم {label};vهل أنت مُصِرّ على استبداله بالرابط الذي تُريد نقله؟
tr: Bu bağlantı zaten {library} kitaplığında, {label} etiketi altında mevcut; Hala taşımak üzere olduğunuzla değiştirmek istiyor musunuz?
uk: Це посилання вже є в бібліотеці {library} під назвою {label}; Ви хочете замінити його на те, яке збираєтеся перемістити?.

source: Unable to move the link to another library
ar: ليس بالإمكان نقل الرابط إلى مكتبة أخرى
tr: Bağlantı başka bir kitaplığa taşınamıyor
uk: Не вдалося перемістити посилання в іншу бібліотеку

source: Are you sure you want to remove the link labeled {} from the library?, this can not be undone.
ar: هل أنتَ متأكِد مِن أنكَ تريدُ إزالةْ الرابط المُسمَّى {} مِن المكتبة؟, فهذا لا يُمكن التراجع عنه.
tr: {} etiketli bağlantıyı kitaplıktan kaldırmak istediğinizden emin misiniz?, bu işlem geri alınamaz.
uk: Ви впевнені, що хочете видалити посилання з назвою {} з бібліотеки? Цю дію неможливо скасувати.

source: Are you sure you want to remove all links from this library?, this can not be undone.
ar: هل أنتَ مُتأكِّد مِن أنكَ تُريد إزالةْ جميع الروابط مِن هذه المكتبة؟ فهذا الأمر لا يُمكن التراجع عنه.
tr: Bu kitaplıktan tüm bağlantıları kaldırmak istediğinizden emin misiniz?, bu işlem geri alınamaz.
uk: Ви впевнені, що хочете видалити всі посилання з цієї бібліотеки? Цю дію неможливо скасувати.

source: Filter by:
ar: التصفية حسب:
tr: Filtrele:
uk: Відфільтрувати за:

source: List Of Links
ar: قائمةُ الروابط
tr: Bağlantı Listesi
uk: Список посилань

source: About The Link
ar: حول الرابط
tr: Bağlantı Hakkında
uk: Про посилання

source: Show Source Url
ar: إظهارُ قيمةِ الرابط
tr: Kaynak URL'yi Göster
uk: Показати URL-адресу джерела

source: Open Link With
ar: إفْتَحْ الرابط بِواسطةْ ...
tr: Bağlantıyı Şununla Aç
uk: Відкрити посилання за допомогою

source: Sub library
ar: مكتبة فرعية
tr: Alt kitaplık
uk: Підбібліотека

source: Unable to load links data
ar: لم يكن بالإمكان تحميل بيانات الروابط
tr: Bağlantı verileri yüklenemiyor
uk: Неможливо завантажити дані посилань

source: link
ar: رابط
tr: bağlantı
uk: посилання

source: links
ar: روابط
tr: bağlantı
uk: посилання

source: Another sub library is opened, close it first please
ar: هناكْ مكتبة فرعية مفتوحة مِن قبلْ; أغلِقْها أولا لو سمَحْت
tr: Başka bir alt kitaplık açık. Lütfen önce açık olanı kapatın
uk: Відкрито іншу підбібліотеку, спочатку закрийте її, будь ласка

source: Link Library
ar: مكتبةْ الروابط
tr: Bağlantı Kitaplığı
uk: Бібліотека посилань

source: &Link Library
ar: &مكتبةْ الروابط
tr: Bağlantı Kitap&lığı
uk: &Бібліотека посилань

source: Link Library Setting...
tr: Bağlantı Kitaplığı Ayarları.
uk: Налаштування бібліотеки посилань...

source: Open Library Dialog
ar: فتح مُحاورةْ المكتبات
tr: Kitaplık İletişim Kutusunu Aç
uk: Відкрити діалог бібліотеки

source: Copy Library Folder
ar: نَسخ مُجَلَّد المكتبات
tr: Kitaplık Klasörünü Kopyala
uk: Копіювати папку бібліотеки

source: Import Library Folder
ar: إستيراد مُجَلَّد المكتبات
tr: Kitaplık Klasörünü İçe Aktar
uk: Імпортувати папку бібліотеки

source: Open Link Library dialog.
ar: فتح مُحاورةْ مكتبةْ الروابط
tr: Bağlantı Kitaplığı iletişim kutusunu aç.
uk: Відкрити діалог Бібліотеки посилань.

source: Add the link and title of web page on the fly to library you choose.
ar: إضافةْ الرابط و عنوان الصفحة للمكتبة التي تختارها بطريقة سريعة
uk: Миттєво додає посилання та назву веб-сторінки до вибраної бібліотеки.

source: Link Library Settings
ar: إعدادات مكتبةْ الروابط
tr: Bağlantı Kitaplığı Ayarları
uk: Налаштування Бібліотеки посилань

source: Choose Path to store Data Files
ar: اختيار مسار لِحفظ ملفات البيانات
tr: Veri Dosyalarını depolamak için Dizin seç
uk: Виберіть шлях для зберігання файлів

source: Add New Path
ar: أضِف مسار جديد
tr: Yeni Dizin Ekle
uk: Додати новий шлях

source: Remove Selected Path
ar: إزالةْ المسار المُحدد
tr: Seçili Dizini Kaldır
uk: Видалити вибраний шлях

source: Do nothing
ar: لا تفعل شيء
tr: Hiçbir şey yapma
uk: Нічого не робити

source: Close library window only
ar: إغلاق نافذةْ المكتبة فقط
tr: Yalnızca kitaplık penceresini kapat
uk: Закрити лише вікно бібліотеки

source: Close main window of addon
ar: إغلاق النافذة الرئيسية للإضافة
tr: Eklentinin ana penceresini kapat
uk: Закрити головне вікно додатка

source: After activating a link:
ar: الإجراء الذي تُريده بعدَ تفعيل الرابط:
tr: Bir bağlantıyı etkinleştirdikten sonra:
uk: Після активації посилання:

source: This path({}) will be permanently removed. This action cannot be undone.
ar: هذا المَسار({}) سيتم إزالته بشكل داءم. هذا الأمر لا يُمكن التراجع عنه.
tr: Bu dizin({}) kalıcı olarak kaldırılacak. Bu işlem geri alınamaz.
uk: Цей шлях ({}) буде остаточно видалено. Цю дію не можна скасувати.

source: Copy Libraries Folder
ar: نَسخ مُجَلَّد المكتبات
tr: Kitaplıklar Klasörünü Kopyala
uk: Копіювати папку бібліотеки

source: To copy libraries folder , please select the path and other options and then press Continue
ar: لِنَسخ مُجَلَّد المكتبات, يُرجى تحديد المسار و الخيارات الأخرى ثُمَّ الضغط على زر مُتابعة
tr: Kitaplıklar klasörünü kopyalamak için lütfen dizini ve diğer seçenekleri seçin ve ardından Devam'a basın
uk: Щоб скопіювати папку бібліотеки, виберіть шлях та інші параметри, а потім натисніть «Продовжити»

source: Destination &directory:
ar: &المسار المقصود
tr: Hedef &dizin:
uk: &Каталог призначення:

source: Browse...
ar: تَصَفُّح...
tr: Gözat...
uk: Огляд...

source: Select Directory
ar: اخترْ المسار
tr: Dizin Seç
uk: Виберіть Каталог

source: &Continue
ar: &مُتابعة
tr: &Devam
uk: &Продовжити

source: Please specify a directory.
ar: الرجاء اختيار المسار.
tr: Lütfen bir dizin belirtin.
uk: Будь ласка, вкажіть каталог.

source: %s is invalid, please select a valid directory path.
ar: %s غير مُناسِب, يُرجى اختيار مَسار مُناسِب.
tr: %s hatalı, lütfen geçerli bir dizin seçin.
uk: %s не знайдено, виберіть правильний шлях до каталогу.

source: Sorry, copying libraries folder did not succeed
ar: المعذرة, لَم تنجحْ عمليةْ نَسخ مُجَلَّد المكتبات
tr: Üzgünüm, kitaplıklar klasörü kopyalanamadı
uk: На жаль, не вдалося скопіювати папку бібліотеки

source: Information:Folder Copied
ar: تنبيه: تَمَّ نَسخ المُجَلَّد
tr: Bilgi: Klasör Kopyalandı
uk: Інформація: папку скопійовано

source: Import Libraries Folder
ar: إستيراد مُجَلَّد المكتبات
tr: Kitaplıklar Klasörünü İçe Aktar
uk: Імпорт папки бібліотеки

source: To import libraries folder , please select the path of folder you want to import, and then press Continue
ar: لِإستيراد مُجَلَّد المكتبات, يُرجى تحديد مَسار المُجَلَّد الذي تُريد استيراده, ثُمَّ اضغط مُتابعة
tr: Kitaplıklar klasörünü içe aktarmak için lütfen içe aktarmak istediğiniz klasörü seçin ve ardından Devam'a basın
uk: Щоб імпортувати папку бібліотеки, виберіть шлях до папки, яку потрібно імпортувати, а потім натисніть «Продовжити»

source: Directory of folder you want to import:
ar: مسار المُجَلَّد الذي تُريد استيراده:
tr: İçe aktarmak istediğiniz klasörün dizini:
uk: Каталог папки, яку потрібно імпортувати:

source: Select Directory to import
ar: اختيار المسار للإستيراد
tr: İçe aktarılacak Dizini seçin
uk: Виберіть каталог для імпорту

source: Sorry, but %s is invalid path.
ar: المعذرة, و لكن %s هو مسار غير مُناسِب.
tr: Üzgünüm, ancak %s geçersiz dizin.
uk: На жаль, але %s не знайдено.

source: Check that the folder name is linkLibrary-addonFiles, and all files in it has a .json extension.
ar: تَحقق مِن أنّ إسم المُجَلَّد هو linkLibrary-addonFiles, و إمتداد جميع الملفات فيه هو .json.
tr: Klasör adının linkLibrary-addonFiles olduğundan ve içindeki tüm dosyaların .json uzantısına sahip olduğundan emin olun.
uk: Переконайтеся, що назва папки — linkLibrary-addonFiles, а всі файли в ній мають розширення .json.

source: You should be aware by this import, the old linkLibrary-addonFiles will be removed and replaced by the newly imported one, and this can not be undone, are you sure you want to proceed?
ar: ينبغي أن تكون مُتَنبِهاً أنهُ في حالةْ الإستيراد, أنّ مُجَلَّد المكتبات القديم سيَتم إزالته و استبداله بالمُجَلَّد الجديد, و هذا لا يُمكل التراجع عنه, هل أنت مُتأكِّد أنكَ تُريد الإستمرار؟
tr: Bu içe aktarmanın farkında olmalısınız, eski linkLibrary-addonFiles kaldırılacak ve yeni içe aktarılanla değiştirilecektir. Bu geri alınamaz, devam etmek istediğinizden emin misiniz?
uk: Слід пам’ятати, що під час цього імпорту старий linkLibrary-addonFiles буде видалено та замінено новим, цю дію не можна скасувати. Ви впевнені, що бажаєте продовжити?

source: Import libraries folder failed.
ar: لَم ينجح استيراد مُجَلَّد المكتبات.
tr: Kitaplıklar klasörü içe aktarılamadı.
uk: Не вдалося імпортувати папку бібліотеки.

source: Information: Libraries folder imported successfuly.
ar: تنبيه: قد تَمَّ استيراد مُجَلَّد المكتبات بنجاح.
tr: Bilgi: Kitaplıklar klasörü başarıyla içe aktarıldı.
uk: Інформація: папку бібліотеки успішно імпортовано.

source: Add new path
ar: أضِفْ مَسار جديد
tr: Yeni dizin ekle
uk: Додати новий шлях

source: Path of the directory:(c:\users\...)
ar: مسار الدليل:(c:\users\...)
tr: Dizin yolu:(c:\users\...)
uk: Шлях до каталогу:(c:\users\...)

source: Enter a general name for the path(example dropbox or Documents or any other)
ar: أدخِلْ إسم عام لِهذا المَسار(مثلا dropbox أو Documents أو أي إسم آخَر)
tr: Yol için genel bir ad girin (örnek dropbox, Belgeler veya başka herhangi biri)
uk: Введіть назву (наприклад, Dropbox, або Documents або будь-яку іншу)

source: Ok
ar: موافق
tr: Tamam
uk: Гаразд

source: Choose library:
uk: Виберіть бібліотеку:

source: This link is already present in {library} library, under {label} label; Do you still want to replace it with the one you are about to add?.
uk: Це посилання вже присутнє в бібліотеці {library}, під міткою {label}; Ви все одно хочете замінити його тим, яке збираєтеся додати?.

source: Unable to add the link to the library
uk: Не вдалося додати посилання до бібліотеки

source: Information: The link was added successfuly to {library} library
ar: تنبيه: لقد تم إضافةْ الرابط بنجاح إلى المكتبة {library}
uk: Інформація: посилання успішно додано до бібліотеки {library}

source: This addon helps the user to arrange his links or bookmarks in library like way. From the main dialog of libraries, you can choose the library or category you like and press enter on it. On the opened dialog, you will have all links in that category in a list and have access to source url an the about info of each llink if present. This addon does not come with a default or assigned gesture or shortcut to it You can as always add a gesture or change the existed one going to : NVDA menu>preferences>inputGestures>Link Library.
ar: هذه الإضافةُ تتيحُ للمستخدمِ عمل مكتبة لِتنظيم و ترتيب الروابط الخاصة به. مِن المُحاوَرة الرئيسية للمكتبات, يُمكنك اختيار المكتبة التي تشاء و فَتحها بالضغط إنتر عليها. و في المحاورة التي ستظهر, يُمكنك الإطِّلاع علىجميع الروابط في هذه المكتبة في قائمة و معلومات حول أي رابط و قيمته إذا كان ذلك موجودا. هذه الإضافةُ لا يُوجد اختصار افتراضي خاص بها و كما هو معروف فيُمكنكَ تغيير أو إضافةْ اختصار لها بالذهاب إلى: قائمةْ NVDA(NVDA+N)>تفضيلات>تخصيص اختصارات NVDA>مكتبةُ الروابط.
tr: Bu eklenti, kullanıcının bağlantılarını veya yer imlerini kitaplıktaki gibi düzenlemesine yardımcı olur.. Kitaplıkların ana iletişim kutusundan, beğendiğiniz kitaplığı veya kategoriyi seçip enter tuşuna basabilirsiniz. Açılan iletişim kutusunda, o kategorideki tüm bağlantılara bir listede sahip olacaksınız ve kaynak url'ye ve varsa her bağlantının hakkında bilgisine erişebileceksiniz. Bu eklenti, varsayılan veya atanmış bir hareket veya kısayol ile gelmiyor Her zaman olduğu gibi bir hareket ekleyebilir veya mevcut olanı şu şekilde değiştirebilirsiniz: NVDA menüsü>tercihler>Girdi hareketleri>Bağlantı Kitaplığı.
uk: Цей додаток допомагає користувачеві розташувати посилання або закладки у вигляді бібліотеки. В головному діалозі бібліотек ви можете вибрати бібліотеку або категорію, що вам сподобалася, і натиснути на ній клавішу Enter. В діалозі, що відкрився, у вас буде список всіх посилань в цій категорії і доступ до вихідного url та інформація про кожне посилання, якщо воно присутнє. Цей додаток початково не має призначених гарячих клавіш Ви можете додати гарячі клавіші або змінити існуючі, перейшовши в: NVDA меню>Параметри>Жести вводу>Бібліотека посилань.

source: Fix a bug in Add a link on the fly feature, now you can add a link to an opened library or sublibrary, which wasn't possible before.
uk: Виправлено помилку у функції «Миттєво додати посилання ». Тепер ви можете додавати посилання до відкритої бібліотеки або підбібліотеки, що раніше було неможливо.

source: Edit Selected
ar: تعديل الرابط المحدد
tr: Seçileni Düzenle

source: Remove Selected
ar: إزالةْ الرابط المحدد
tr: Seçili olanları Kaldır

source: Url:
ar: الرابط:
